
{
    "projects": [
    {
      "id": 1, 
      "logo": "/LogoYeah.png",
      "title": "Communiti Live Chat",
      "description": "I took on this project after i came across an instagram post showcasing a really sweet chat application based off of the Kik platform. I decided it would be a great oppurunity to jump back into dealing with user authentication and database persistance. I had some trouble dealing with the persistance for the chat messages and so i decided just use firebase as it was a simple and small app",
      "imgOne": "/communitiImg.png",
      "iconOne":"/reactIcon.png",
      "iconTwo":  "/JsIcon.png" ,
      "iconThree": "/firebaseIcon.svg",
      "iconFour": "/chakraImg.png",
      "liveUrl": "https://www.google.com",
      "repoUrl": "https://www.github.com"
    },
    {
      "id": 2,
      "imgSrc": "/GigaChad.png",
      "title": "Giga Chad's Crypto Fraternity",
      "description": "Giga Chad is an online crypto trading network also referred to as a crypto fraternity. With a community of over 30,000 members. Our network consists of a wide range of various personalities, specialties, nationalities and interests. Giga Chad is a place where crypto traders from all around the world can come together, share resources, and create new connections that lead to new oppurtunities and knowledge in the fast changing world of crypto currency.",
      "imgOne": "/GigaChadImg.png",
      "iconOne":"/reactIcon.png",
      "iconTwo": "/StyledComponentsIcon.png",
      "liveUrl": "https://www.google.com",
      "repoUrl": "https://www.github.com"
    },
    {
      "id": 3,
      "imgSrc": "/TimerLogo.png",
      "title": "Pomodoro Timer",
      "description": "This project is another remake of the famous pomodoro. It use a timer to break work into intervals, in most cases 25 minutes in length, seperated by short breaks. Each interval is known as a pomodoro. I built this app so i could have a custom made version of the pomodoro timer in hopes that it would improve my efficiency and time management when working on other projects. I will eventually be converting it to a mobile app using React Native.",
      "imgOne": "/PomodoroImg.png",
      "iconOne":"/reactIcon.png",
      "iconTwo": "/JestIcon.png" ,
      "iconThree": "/CSSIcon.png",
      "iconFour": "/JsIcon.png",
      "liveUrl": "https://www.google.com",
      "repoUrl": "https://www.github.com"
    },
    {
      "id": 4,
      "imgSrc": "/ApexLogo.png",
      "title": "Apex Security",
      "description": "Apex Security is a concept website for a made up CyberSecurity company and the inspiration came from the TCM Cyber Security website. The aesthetics and design possibility that comes with a website as such is amazing and it really inspired me and so I decided i wanted to try replicating the website but with some different technologies and slight design tweaks. As im learning new techniques in other projects i am still building Apex as well as implementing these new design techniques",
      "imgOne": "/ApexImg.png",
      "iconOne":"/NextJsIcon.png",
      "iconTwo": "/FramerMotionIcon.png" ,
      "iconThree": "/ThemeUIIcon.png",
      "iconFour": "/VercelIcon.png",
      "liveUrl": "https://next-js-sec-nbfxbdm51-jackxn.vercel.app/",
      "repoUrl": "https://github.com/JackXN/next-js-sec"
    },
    {
      "id": 5,
      "imgSrc": "RestaurantLogo.png",
      "title": "Restaurant Reservation App",
      "description": "This fullstack web application was built as a restaurant management tool for in-house seating and party reservations. It utilizes a simple to use dashboard where a user can create a new reservation and reserve seats for those reservations in a few simple click and clacks. The users information is then saved in the database and listed as a new reservation.  I intend on updating the front end design in the near future",
      "imgOne": "/ResImg.png",
      "iconOne":"/reactIcon.png",
      "iconTwo": "/SQLIcon.png",
      "iconThree": "/NodeIcon.png",
      "iconFour": "/MochaChaiIcon.png",
      "liveUrl": "https://periodic-tables-frontend-g5bb766k5-keithfrazier98.vercel.app/dashboard",
      "repoUrl": "https://github.com/JackXN/Restaurant-Reservation"
    },
    {
      "id": 6,
      "imgSrc": "PAXLogo.png",
      "title": "PAX SMP",
      "description": "Landing Page For A Minecraft SMP Server",
      "imgOne": "/PaxImg.png",
      "iconOne":"React",
      "iconTwo": "JavaScript" ,
      "icontThree": "/NodeIcon.png",
      "iconFour": "SQL",
      "liveUrl": "https://pax-smp-kwx6kx4d7-jackxn.vercel.app/",
      "repoUrl": "https://www.github.com"
    },
    {
      "id": "7",
      "imgSrc": "DecoderLogo.png",
      "title": "The Decoder Ring",
      "description": "An App Designed To Encrypt And Decrypt Secret Messages",
      "imgOne": "https://imgur.com/a/LtwCthu",
      "iconOne":"React",
      "iconTwo": "JavaScript" ,
      "iconThree": "Node",
      "iconFour": "SQL",
      "liveUrl": "https://www.google.com",
      "repoUrl": "https://www.github.com"
    }
]
}
